Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_bdma.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32H743_bdma equates.
 */

#pragma once

#include    <stdint.h>

// BDMA address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    ISR;
    volatile    uint32_t    IFCR;
    volatile    uint32_t    CCR0;
    volatile    uint32_t    CNDTR0;
    volatile    uint32_t    CPAR0;
    volatile    uint32_t    CM0AR0;
    volatile    uint32_t    CM1AR0;
    volatile    uint32_t    CCR1;
    volatile    uint32_t    CNDTR1;
    volatile    uint32_t    CPAR1;
    volatile    uint32_t    CM0AR1;
    volatile    uint32_t    CM1AR1;
    volatile    uint32_t    CCR2;
    volatile    uint32_t    CNDTR2;
    volatile    uint32_t    CPAR2;
    volatile    uint32_t    CM0AR2;
    volatile    uint32_t    CM1AR2;
    volatile    uint32_t    CCR3;
    volatile    uint32_t    CNDTR3;
    volatile    uint32_t    CPAR3;
    volatile    uint32_t    CM0AR3;
    volatile    uint32_t    CM1AR3;
    volatile    uint32_t    CCR4;
    volatile    uint32_t    CNDTR4;
    volatile    uint32_t    CPAR4;
    volatile    uint32_t    CM0AR4;
    volatile    uint32_t    CM1AR4;
    volatile    uint32_t    CCR5;
    volatile    uint32_t    CNDTR5;
    volatile    uint32_t    CPAR5;
    volatile    uint32_t    CM0AR5;
    volatile    uint32_t    CM1AR5;
    volatile    uint32_t    CCR6;
    volatile    uint32_t    CNDTR6;
    volatile    uint32_t    CPAR6;
    volatile    uint32_t    CM0AR6;
    volatile    uint32_t    CM1AR6;
    volatile    uint32_t    CCR7;
    volatile    uint32_t    CNDTR7;
    volatile    uint32_t    CPAR7;
    volatile    uint32_t    CM0AR7;
    volatile    uint32_t    CM1AR7;
} BDMA_TypeDef;

#ifdef __cplusplus
#define BDMA    reinterpret_cast<BDMA_TypeDef *>(0x58025400U)

#else
#define BDMA    ((BDMA_TypeDef *)0x58025400U)
#endif

// ISR Configuration

#define BDMA_ISR_TEIF7          (0x1U<<31)
#define BDMA_ISR_HTIF7          (0x1U<<30)
#define BDMA_ISR_TCIF7          (0x1U<<29)
#define BDMA_ISR_GIF7           (0x1U<<28)
#define BDMA_ISR_TEIF6          (0x1U<<27)
#define BDMA_ISR_HTIF6          (0x1U<<26)
#define BDMA_ISR_TCIF6          (0x1U<<25)
#define BDMA_ISR_GIF6           (0x1U<<24)
#define BDMA_ISR_TEIF5          (0x1U<<23)
#define BDMA_ISR_HTIF5          (0x1U<<22)
#define BDMA_ISR_TCIF5          (0x1U<<21)
#define BDMA_ISR_GIF5           (0x1U<<20)
#define BDMA_ISR_TEIF4          (0x1U<<19)
#define BDMA_ISR_HTIF4          (0x1U<<18)
#define BDMA_ISR_TCIF4          (0x1U<<17)
#define BDMA_ISR_GIF4           (0x1U<<16)
#define BDMA_ISR_TEIF3          (0x1U<<15)
#define BDMA_ISR_HTIF3          (0x1U<<14)
#define BDMA_ISR_TCIF3          (0x1U<<13)
#define BDMA_ISR_GIF3           (0x1U<<12)
#define BDMA_ISR_TEIF2          (0x1U<<11)
#define BDMA_ISR_HTIF2          (0x1U<<10)
#define BDMA_ISR_TCIF2          (0x1U<<9)
#define BDMA_ISR_GIF2           (0x1U<<8)
#define BDMA_ISR_TEIF1          (0x1U<<7)
#define BDMA_ISR_HTIF1          (0x1U<<6)
#define BDMA_ISR_TCIF1          (0x1U<<5)
#define BDMA_ISR_GIF1           (0x1U<<4)
#define BDMA_ISR_TEIF0          (0x1U<<3)
#define BDMA_ISR_HTIF0          (0x1U<<2)
#define BDMA_ISR_TCIF0          (0x1U<<1)
#define BDMA_ISR_GIF0           (0x1U<<0)
#define BDMA_ISR_TEIF7_B_0X0    (0x0U<<31)
#define BDMA_ISR_TEIF7_B_0X1    (0x1U<<31)
#define BDMA_ISR_HTIF7_B_0X0    (0x0U<<30)
#define BDMA_ISR_HTIF7_B_0X1    (0x1U<<30)
#define BDMA_ISR_TCIF7_B_0X0    (0x0U<<29)
#define BDMA_ISR_TCIF7_B_0X1    (0x1U<<29)
#define BDMA_ISR_GIF7_B_0X0     (0x0U<<28)
#define BDMA_ISR_GIF7_B_0X1     (0x1U<<28)
#define BDMA_ISR_TEIF6_B_0X0    (0x0U<<27)
#define BDMA_ISR_TEIF6_B_0X1    (0x1U<<27)
#define BDMA_ISR_HTIF6_B_0X0    (0x0U<<26)
#define BDMA_ISR_HTIF6_B_0X1    (0x1U<<26)
#define BDMA_ISR_TCIF6_B_0X0    (0x0U<<25)
#define BDMA_ISR_TCIF6_B_0X1    (0x1U<<25)
#define BDMA_ISR_GIF6_B_0X0     (0x0U<<24)
#define BDMA_ISR_GIF6_B_0X1     (0x1U<<24)
#define BDMA_ISR_TEIF5_B_0X0    (0x0U<<23)
#define BDMA_ISR_TEIF5_B_0X1    (0x1U<<23)
#define BDMA_ISR_HTIF5_B_0X0    (0x0U<<22)
#define BDMA_ISR_HTIF5_B_0X1    (0x1U<<22)
#define BDMA_ISR_TCIF5_B_0X0    (0x0U<<21)
#define BDMA_ISR_TCIF5_B_0X1    (0x1U<<21)
#define BDMA_ISR_GIF5_B_0X0     (0x0U<<20)
#define BDMA_ISR_GIF5_B_0X1     (0x1U<<20)
#define BDMA_ISR_TEIF4_B_0X0    (0x0U<<19)
#define BDMA_ISR_TEIF4_B_0X1    (0x1U<<19)
#define BDMA_ISR_HTIF4_B_0X0    (0x0U<<18)
#define BDMA_ISR_HTIF4_B_0X1    (0x1U<<18)
#define BDMA_ISR_TCIF4_B_0X0    (0x0U<<17)
#define BDMA_ISR_TCIF4_B_0X1    (0x1U<<17)
#define BDMA_ISR_GIF4_B_0X0     (0x0U<<16)
#define BDMA_ISR_GIF4_B_0X1     (0x1U<<16)
#define BDMA_ISR_TEIF3_B_0X0    (0x0U<<15)
#define BDMA_ISR_TEIF3_B_0X1    (0x1U<<15)
#define BDMA_ISR_HTIF3_B_0X0    (0x0U<<14)
#define BDMA_ISR_HTIF3_B_0X1    (0x1U<<14)
#define BDMA_ISR_TCIF3_B_0X0    (0x0U<<13)
#define BDMA_ISR_TCIF3_B_0X1    (0x1U<<13)
#define BDMA_ISR_GIF3_B_0X0     (0x0U<<12)
#define BDMA_ISR_GIF3_B_0X1     (0x1U<<12)
#define BDMA_ISR_TEIF2_B_0X0    (0x0U<<11)
#define BDMA_ISR_TEIF2_B_0X1    (0x1U<<11)
#define BDMA_ISR_HTIF2_B_0X0    (0x0U<<10)
#define BDMA_ISR_HTIF2_B_0X1    (0x1U<<10)
#define BDMA_ISR_TCIF2_B_0X0    (0x0U<<9)
#define BDMA_ISR_TCIF2_B_0X1    (0x1U<<9)
#define BDMA_ISR_GIF2_B_0X0     (0x0U<<8)
#define BDMA_ISR_GIF2_B_0X1     (0x1U<<8)
#define BDMA_ISR_TEIF1_B_0X0    (0x0U<<7)
#define BDMA_ISR_TEIF1_B_0X1    (0x1U<<7)
#define BDMA_ISR_HTIF1_B_0X0    (0x0U<<6)
#define BDMA_ISR_HTIF1_B_0X1    (0x1U<<6)
#define BDMA_ISR_TCIF1_B_0X0    (0x0U<<5)
#define BDMA_ISR_TCIF1_B_0X1    (0x1U<<5)
#define BDMA_ISR_GIF1_B_0X0     (0x0U<<4)
#define BDMA_ISR_GIF1_B_0X1     (0x1U<<4)
#define BDMA_ISR_TEIF0_B_0X0    (0x0U<<3)
#define BDMA_ISR_TEIF0_B_0X1    (0x1U<<3)
#define BDMA_ISR_HTIF0_B_0X0    (0x0U<<2)
#define BDMA_ISR_HTIF0_B_0X1    (0x1U<<2)
#define BDMA_ISR_TCIF0_B_0X0    (0x0U<<1)
#define BDMA_ISR_TCIF0_B_0X1    (0x1U<<1)
#define BDMA_ISR_GIF0_B_0X0     (0x0U<<0)
#define BDMA_ISR_GIF0_B_0X1     (0x1U<<0)

// IFCR Configuration

#define BDMA_IFCR_CTEIF7        (0x1U<<31)
#define BDMA_IFCR_CHTIF7        (0x1U<<30)
#define BDMA_IFCR_CTCIF7        (0x1U<<29)
#define BDMA_IFCR_CGIF7         (0x1U<<28)
#define BDMA_IFCR_CTEIF6        (0x1U<<27)
#define BDMA_IFCR_CHTIF6        (0x1U<<26)
#define BDMA_IFCR_CTCIF6        (0x1U<<25)
#define BDMA_IFCR_CGIF6         (0x1U<<24)
#define BDMA_IFCR_CTEIF5        (0x1U<<23)
#define BDMA_IFCR_CHTIF5        (0x1U<<22)
#define BDMA_IFCR_CTCIF5        (0x1U<<21)
#define BDMA_IFCR_CGIF5         (0x1U<<20)
#define BDMA_IFCR_CTEIF4        (0x1U<<19)
#define BDMA_IFCR_CHTIF4        (0x1U<<18)
#define BDMA_IFCR_CTCIF4        (0x1U<<17)
#define BDMA_IFCR_CGIF4         (0x1U<<16)
#define BDMA_IFCR_CTEIF3        (0x1U<<15)
#define BDMA_IFCR_CHTIF3        (0x1U<<14)
#define BDMA_IFCR_CTCIF3        (0x1U<<13)
#define BDMA_IFCR_CGIF3         (0x1U<<12)
#define BDMA_IFCR_CTEIF2        (0x1U<<11)
#define BDMA_IFCR_CHTIF2        (0x1U<<10)
#define BDMA_IFCR_CTCIF2        (0x1U<<9)
#define BDMA_IFCR_CGIF2         (0x1U<<8)
#define BDMA_IFCR_CTEIF1        (0x1U<<7)
#define BDMA_IFCR_CHTIF1        (0x1U<<6)
#define BDMA_IFCR_CTCIF1        (0x1U<<5)
#define BDMA_IFCR_CGIF1         (0x1U<<4)
#define BDMA_IFCR_CTEIF0        (0x1U<<3)
#define BDMA_IFCR_CHTIF0        (0x1U<<2)
#define BDMA_IFCR_CTCIF0        (0x1U<<1)
#define BDMA_IFCR_CGIF0         (0x1U<<0)

// CCR0 Configuration

#define BDMA_CCR0_CT            (0x1U<<16)
#define BDMA_CCR0_DBM           (0x1U<<15)
#define BDMA_CCR0_MEM2MEM       (0x1U<<14)
#define BDMA_CCR0_PL            (0x3U<<12)
#define BDMA_CCR0_PL_0          (0x1U<<12)
#define BDMA_CCR0_MSIZE         (0x3U<<10)
#define BDMA_CCR0_MSIZE_0       (0x1U<<10)
#define BDMA_CCR0_PSIZE         (0x3U<<8)
#define BDMA_CCR0_PSIZE_0       (0x1U<<8)
#define BDMA_CCR0_MINC          (0x1U<<7)
#define BDMA_CCR0_PINC          (0x1U<<6)
#define BDMA_CCR0_CIRC          (0x1U<<5)
#define BDMA_CCR0_DIR           (0x1U<<4)
#define BDMA_CCR0_TEIE          (0x1U<<3)
#define BDMA_CCR0_HTIE          (0x1U<<2)
#define BDMA_CCR0_TCIE          (0x1U<<1)
#define BDMA_CCR0_EN            (0x1U<<0)
#define BDMA_CCR0_CT_B_0X0      (0x0U<<16)
#define BDMA_CCR0_CT_B_0X1      (0x1U<<16)
#define BDMA_CCR0_DBM_B_0X0     (0x0U<<15)
#define BDMA_CCR0_DBM_B_0X1     (0x1U<<15)
#define BDMA_CCR0_MEM2MEM_B_0X0 (0x0U<<14)
#define BDMA_CCR0_MEM2MEM_B_0X1 (0x1U<<14)
#define BDMA_CCR0_PL_B_0X0      (0x0U<<12)
#define BDMA_CCR0_PL_B_0X1      (0x1U<<12)
#define BDMA_CCR0_PL_B_0X2      (0x2U<<12)
#define BDMA_CCR0_PL_B_0X3      (0x3U<<12)
#define BDMA_CCR0_MSIZE_B_0X0   (0x0U<<10)
#define BDMA_CCR0_MSIZE_B_0X1   (0x1U<<10)
#define BDMA_CCR0_MSIZE_B_0X2   (0x2U<<10)
#define BDMA_CCR0_PSIZE_B_0X0   (0x0U<<8)
#define BDMA_CCR0_PSIZE_B_0X1   (0x1U<<8)
#define BDMA_CCR0_PSIZE_B_0X2   (0x2U<<8)
#define BDMA_CCR0_MINC_B_0X0    (0x0U<<7)
#define BDMA_CCR0_MINC_B_0X1    (0x1U<<7)
#define BDMA_CCR0_PINC_B_0X0    (0x0U<<6)
#define BDMA_CCR0_PINC_B_0X1    (0x1U<<6)
#define BDMA_CCR0_CIRC_B_0X0    (0x0U<<5)
#define BDMA_CCR0_CIRC_B_0X1    (0x1U<<5)
#define BDMA_CCR0_DIR_B_0X0     (0x0U<<4)
#define BDMA_CCR0_DIR_B_0X1     (0x1U<<4)
#define BDMA_CCR0_TEIE_B_0X0    (0x0U<<3)
#define BDMA_CCR0_TEIE_B_0X1    (0x1U<<3)
#define BDMA_CCR0_HTIE_B_0X0    (0x0U<<2)
#define BDMA_CCR0_HTIE_B_0X1    (0x1U<<2)
#define BDMA_CCR0_TCIE_B_0X0    (0x0U<<1)
#define BDMA_CCR0_TCIE_B_0X1    (0x1U<<1)
#define BDMA_CCR0_EN_B_0X0      (0x0U<<0)
#define BDMA_CCR0_EN_B_0X1      (0x1U<<0)

// CNDTR0 Configuration

