Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_bdma.h
#define BDMA_CNDTR0_NDT         (0xFFFFU<<0)
#define BDMA_CNDTR0_NDT_0       (0x1U<<0)

// CPAR0 Configuration

#define BDMA_CPAR0_PA           (0xFFFFFFFFU<<0)
#define BDMA_CPAR0_PA_0         (0x1U<<0)

// CM0AR0 Configuration

#define BDMA_CM0AR0_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM0AR0_MA_0        (0x1U<<0)

// CM1AR0 Configuration

#define BDMA_CM1AR0_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM1AR0_MA_0        (0x1U<<0)

// CCR1 Configuration

#define BDMA_CCR1_CT            (0x1U<<16)
#define BDMA_CCR1_DBM           (0x1U<<15)
#define BDMA_CCR1_MEM2MEM       (0x1U<<14)
#define BDMA_CCR1_PL            (0x3U<<12)
#define BDMA_CCR1_PL_0          (0x1U<<12)
#define BDMA_CCR1_MSIZE         (0x3U<<10)
#define BDMA_CCR1_MSIZE_0       (0x1U<<10)
#define BDMA_CCR1_PSIZE         (0x3U<<8)
#define BDMA_CCR1_PSIZE_0       (0x1U<<8)
#define BDMA_CCR1_MINC          (0x1U<<7)
#define BDMA_CCR1_PINC          (0x1U<<6)
#define BDMA_CCR1_CIRC          (0x1U<<5)
#define BDMA_CCR1_DIR           (0x1U<<4)
#define BDMA_CCR1_TEIE          (0x1U<<3)
#define BDMA_CCR1_HTIE          (0x1U<<2)
#define BDMA_CCR1_TCIE          (0x1U<<1)
#define BDMA_CCR1_EN            (0x1U<<0)
#define BDMA_CCR1_CT_B_0X0      (0x0U<<16)
#define BDMA_CCR1_CT_B_0X1      (0x1U<<16)
#define BDMA_CCR1_DBM_B_0X0     (0x0U<<15)
#define BDMA_CCR1_DBM_B_0X1     (0x1U<<15)
#define BDMA_CCR1_MEM2MEM_B_0X0 (0x0U<<14)
#define BDMA_CCR1_MEM2MEM_B_0X1 (0x1U<<14)
#define BDMA_CCR1_PL_B_0X0      (0x0U<<12)
#define BDMA_CCR1_PL_B_0X1      (0x1U<<12)
#define BDMA_CCR1_PL_B_0X2      (0x2U<<12)
#define BDMA_CCR1_PL_B_0X3      (0x3U<<12)
#define BDMA_CCR1_MSIZE_B_0X0   (0x0U<<10)
#define BDMA_CCR1_MSIZE_B_0X1   (0x1U<<10)
#define BDMA_CCR1_MSIZE_B_0X2   (0x2U<<10)
#define BDMA_CCR1_PSIZE_B_0X0   (0x0U<<8)
#define BDMA_CCR1_PSIZE_B_0X1   (0x1U<<8)
#define BDMA_CCR1_PSIZE_B_0X2   (0x2U<<8)
#define BDMA_CCR1_MINC_B_0X0    (0x0U<<7)
#define BDMA_CCR1_MINC_B_0X1    (0x1U<<7)
#define BDMA_CCR1_PINC_B_0X0    (0x0U<<6)
#define BDMA_CCR1_PINC_B_0X1    (0x1U<<6)
#define BDMA_CCR1_CIRC_B_0X0    (0x0U<<5)
#define BDMA_CCR1_CIRC_B_0X1    (0x1U<<5)
#define BDMA_CCR1_DIR_B_0X0     (0x0U<<4)
#define BDMA_CCR1_DIR_B_0X1     (0x1U<<4)
#define BDMA_CCR1_TEIE_B_0X0    (0x0U<<3)
#define BDMA_CCR1_TEIE_B_0X1    (0x1U<<3)
#define BDMA_CCR1_HTIE_B_0X0    (0x0U<<2)
#define BDMA_CCR1_HTIE_B_0X1    (0x1U<<2)
#define BDMA_CCR1_TCIE_B_0X0    (0x0U<<1)
#define BDMA_CCR1_TCIE_B_0X1    (0x1U<<1)
#define BDMA_CCR1_EN_B_0X0      (0x0U<<0)
#define BDMA_CCR1_EN_B_0X1      (0x1U<<0)

// CNDTR1 Configuration

#define BDMA_CNDTR1_NDT         (0xFFFFU<<0)
#define BDMA_CNDTR1_NDT_0       (0x1U<<0)

// CPAR1 Configuration

#define BDMA_CPAR1_PA           (0xFFFFFFFFU<<0)
#define BDMA_CPAR1_PA_0         (0x1U<<0)

// CM0AR1 Configuration

#define BDMA_CM0AR1_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM0AR1_MA_0        (0x1U<<0)

// CM1AR1 Configuration

#define BDMA_CM1AR1_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM1AR1_MA_0        (0x1U<<0)

// CCR2 Configuration

#define BDMA_CCR2_CT            (0x1U<<16)
#define BDMA_CCR2_DBM           (0x1U<<15)
#define BDMA_CCR2_MEM2MEM       (0x1U<<14)
#define BDMA_CCR2_PL            (0x3U<<12)
#define BDMA_CCR2_PL_0          (0x1U<<12)
#define BDMA_CCR2_MSIZE         (0x3U<<10)
#define BDMA_CCR2_MSIZE_0       (0x1U<<10)
#define BDMA_CCR2_PSIZE         (0x3U<<8)
#define BDMA_CCR2_PSIZE_0       (0x1U<<8)
#define BDMA_CCR2_MINC          (0x1U<<7)
#define BDMA_CCR2_PINC          (0x1U<<6)
#define BDMA_CCR2_CIRC          (0x1U<<5)
#define BDMA_CCR2_DIR           (0x1U<<4)
#define BDMA_CCR2_TEIE          (0x1U<<3)
#define BDMA_CCR2_HTIE          (0x1U<<2)
#define BDMA_CCR2_TCIE          (0x1U<<1)
#define BDMA_CCR2_EN            (0x1U<<0)
#define BDMA_CCR2_CT_B_0X0      (0x0U<<16)
#define BDMA_CCR2_CT_B_0X1      (0x1U<<16)
#define BDMA_CCR2_DBM_B_0X0     (0x0U<<15)
#define BDMA_CCR2_DBM_B_0X1     (0x1U<<15)
#define BDMA_CCR2_MEM2MEM_B_0X0 (0x0U<<14)
#define BDMA_CCR2_MEM2MEM_B_0X1 (0x1U<<14)
#define BDMA_CCR2_PL_B_0X0      (0x0U<<12)
#define BDMA_CCR2_PL_B_0X1      (0x1U<<12)
#define BDMA_CCR2_PL_B_0X2      (0x2U<<12)
#define BDMA_CCR2_PL_B_0X3      (0x3U<<12)
#define BDMA_CCR2_MSIZE_B_0X0   (0x0U<<10)
#define BDMA_CCR2_MSIZE_B_0X1   (0x1U<<10)
#define BDMA_CCR2_MSIZE_B_0X2   (0x2U<<10)
#define BDMA_CCR2_PSIZE_B_0X0   (0x0U<<8)
#define BDMA_CCR2_PSIZE_B_0X1   (0x1U<<8)
#define BDMA_CCR2_PSIZE_B_0X2   (0x2U<<8)
#define BDMA_CCR2_MINC_B_0X0    (0x0U<<7)
#define BDMA_CCR2_MINC_B_0X1    (0x1U<<7)
#define BDMA_CCR2_PINC_B_0X0    (0x0U<<6)
#define BDMA_CCR2_PINC_B_0X1    (0x1U<<6)
#define BDMA_CCR2_CIRC_B_0X0    (0x0U<<5)
#define BDMA_CCR2_CIRC_B_0X1    (0x1U<<5)
#define BDMA_CCR2_DIR_B_0X0     (0x0U<<4)
#define BDMA_CCR2_DIR_B_0X1     (0x1U<<4)
#define BDMA_CCR2_TEIE_B_0X0    (0x0U<<3)
#define BDMA_CCR2_TEIE_B_0X1    (0x1U<<3)
#define BDMA_CCR2_HTIE_B_0X0    (0x0U<<2)
#define BDMA_CCR2_HTIE_B_0X1    (0x1U<<2)
#define BDMA_CCR2_TCIE_B_0X0    (0x0U<<1)
#define BDMA_CCR2_TCIE_B_0X1    (0x1U<<1)
#define BDMA_CCR2_EN_B_0X0      (0x0U<<0)
#define BDMA_CCR2_EN_B_0X1      (0x1U<<0)

// CNDTR2 Configuration

#define BDMA_CNDTR2_NDT         (0xFFFFU<<0)
#define BDMA_CNDTR2_NDT_0       (0x1U<<0)

// CPAR2 Configuration

#define BDMA_CPAR2_PA           (0xFFFFFFFFU<<0)
#define BDMA_CPAR2_PA_0         (0x1U<<0)

// CM0AR2 Configuration

#define BDMA_CM0AR2_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM0AR2_MA_0        (0x1U<<0)

// CM1AR2 Configuration

#define BDMA_CM1AR2_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM1AR2_MA_0        (0x1U<<0)

// CCR3 Configuration

#define BDMA_CCR3_CT            (0x1U<<16)
#define BDMA_CCR3_DBM           (0x1U<<15)
#define BDMA_CCR3_MEM2MEM       (0x1U<<14)
#define BDMA_CCR3_PL            (0x3U<<12)
#define BDMA_CCR3_PL_0          (0x1U<<12)
#define BDMA_CCR3_MSIZE         (0x3U<<10)
#define BDMA_CCR3_MSIZE_0       (0x1U<<10)
#define BDMA_CCR3_PSIZE         (0x3U<<8)
#define BDMA_CCR3_PSIZE_0       (0x1U<<8)
#define BDMA_CCR3_MINC          (0x1U<<7)
#define BDMA_CCR3_PINC          (0x1U<<6)
#define BDMA_CCR3_CIRC          (0x1U<<5)
#define BDMA_CCR3_DIR           (0x1U<<4)
#define BDMA_CCR3_TEIE          (0x1U<<3)
#define BDMA_CCR3_HTIE          (0x1U<<2)
#define BDMA_CCR3_TCIE          (0x1U<<1)
#define BDMA_CCR3_EN            (0x1U<<0)
#define BDMA_CCR3_CT_B_0X0      (0x0U<<16)
#define BDMA_CCR3_CT_B_0X1      (0x1U<<16)
#define BDMA_CCR3_DBM_B_0X0     (0x0U<<15)
#define BDMA_CCR3_DBM_B_0X1     (0x1U<<15)
#define BDMA_CCR3_MEM2MEM_B_0X0 (0x0U<<14)
#define BDMA_CCR3_MEM2MEM_B_0X1 (0x1U<<14)
#define BDMA_CCR3_PL_B_0X0      (0x0U<<12)
#define BDMA_CCR3_PL_B_0X1      (0x1U<<12)
#define BDMA_CCR3_PL_B_0X2      (0x2U<<12)
#define BDMA_CCR3_PL_B_0X3      (0x3U<<12)
#define BDMA_CCR3_MSIZE_B_0X0   (0x0U<<10)
#define BDMA_CCR3_MSIZE_B_0X1   (0x1U<<10)
#define BDMA_CCR3_MSIZE_B_0X2   (0x2U<<10)
#define BDMA_CCR3_PSIZE_B_0X0   (0x0U<<8)
#define BDMA_CCR3_PSIZE_B_0X1   (0x1U<<8)
#define BDMA_CCR3_PSIZE_B_0X2   (0x2U<<8)
#define BDMA_CCR3_MINC_B_0X0    (0x0U<<7)
#define BDMA_CCR3_MINC_B_0X1    (0x1U<<7)
#define BDMA_CCR3_PINC_B_0X0    (0x0U<<6)
#define BDMA_CCR3_PINC_B_0X1    (0x1U<<6)
#define BDMA_CCR3_CIRC_B_0X0    (0x0U<<5)
#define BDMA_CCR3_CIRC_B_0X1    (0x1U<<5)
#define BDMA_CCR3_DIR_B_0X0     (0x0U<<4)
#define BDMA_CCR3_DIR_B_0X1     (0x1U<<4)
#define BDMA_CCR3_TEIE_B_0X0    (0x0U<<3)
#define BDMA_CCR3_TEIE_B_0X1    (0x1U<<3)
#define BDMA_CCR3_HTIE_B_0X0    (0x0U<<2)
#define BDMA_CCR3_HTIE_B_0X1    (0x1U<<2)
#define BDMA_CCR3_TCIE_B_0X0    (0x0U<<1)
#define BDMA_CCR3_TCIE_B_0X1    (0x1U<<1)
#define BDMA_CCR3_EN_B_0X0      (0x0U<<0)
#define BDMA_CCR3_EN_B_0X1      (0x1U<<0)

// CNDTR3 Configuration

