Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_bdma.h
#define BDMA_CNDTR3_NDT         (0xFFFFU<<0)
#define BDMA_CNDTR3_NDT_0       (0x1U<<0)

// CPAR3 Configuration

#define BDMA_CPAR3_PA           (0xFFFFFFFFU<<0)
#define BDMA_CPAR3_PA_0         (0x1U<<0)

// CM0AR3 Configuration

#define BDMA_CM0AR3_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM0AR3_MA_0        (0x1U<<0)

// CM1AR3 Configuration

#define BDMA_CM1AR3_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM1AR3_MA_0        (0x1U<<0)

// CCR4 Configuration

#define BDMA_CCR4_CT            (0x1U<<16)
#define BDMA_CCR4_DBM           (0x1U<<15)
#define BDMA_CCR4_MEM2MEM       (0x1U<<14)
#define BDMA_CCR4_PL            (0x3U<<12)
#define BDMA_CCR4_PL_0          (0x1U<<12)
#define BDMA_CCR4_MSIZE         (0x3U<<10)
#define BDMA_CCR4_MSIZE_0       (0x1U<<10)
#define BDMA_CCR4_PSIZE         (0x3U<<8)
#define BDMA_CCR4_PSIZE_0       (0x1U<<8)
#define BDMA_CCR4_MINC          (0x1U<<7)
#define BDMA_CCR4_PINC          (0x1U<<6)
#define BDMA_CCR4_CIRC          (0x1U<<5)
#define BDMA_CCR4_DIR           (0x1U<<4)
#define BDMA_CCR4_TEIE          (0x1U<<3)
#define BDMA_CCR4_HTIE          (0x1U<<2)
#define BDMA_CCR4_TCIE          (0x1U<<1)
#define BDMA_CCR4_EN            (0x1U<<0)
#define BDMA_CCR4_CT_B_0X0      (0x0U<<16)
#define BDMA_CCR4_CT_B_0X1      (0x1U<<16)
#define BDMA_CCR4_DBM_B_0X0     (0x0U<<15)
#define BDMA_CCR4_DBM_B_0X1     (0x1U<<15)
#define BDMA_CCR4_MEM2MEM_B_0X0 (0x0U<<14)
#define BDMA_CCR4_MEM2MEM_B_0X1 (0x1U<<14)
#define BDMA_CCR4_PL_B_0X0      (0x0U<<12)
#define BDMA_CCR4_PL_B_0X1      (0x1U<<12)
#define BDMA_CCR4_PL_B_0X2      (0x2U<<12)
#define BDMA_CCR4_PL_B_0X3      (0x3U<<12)
#define BDMA_CCR4_MSIZE_B_0X0   (0x0U<<10)
#define BDMA_CCR4_MSIZE_B_0X1   (0x1U<<10)
#define BDMA_CCR4_MSIZE_B_0X2   (0x2U<<10)
#define BDMA_CCR4_PSIZE_B_0X0   (0x0U<<8)
#define BDMA_CCR4_PSIZE_B_0X1   (0x1U<<8)
#define BDMA_CCR4_PSIZE_B_0X2   (0x2U<<8)
#define BDMA_CCR4_MINC_B_0X0    (0x0U<<7)
#define BDMA_CCR4_MINC_B_0X1    (0x1U<<7)
#define BDMA_CCR4_PINC_B_0X0    (0x0U<<6)
#define BDMA_CCR4_PINC_B_0X1    (0x1U<<6)
#define BDMA_CCR4_CIRC_B_0X0    (0x0U<<5)
#define BDMA_CCR4_CIRC_B_0X1    (0x1U<<5)
#define BDMA_CCR4_DIR_B_0X0     (0x0U<<4)
#define BDMA_CCR4_DIR_B_0X1     (0x1U<<4)
#define BDMA_CCR4_TEIE_B_0X0    (0x0U<<3)
#define BDMA_CCR4_TEIE_B_0X1    (0x1U<<3)
#define BDMA_CCR4_HTIE_B_0X0    (0x0U<<2)
#define BDMA_CCR4_HTIE_B_0X1    (0x1U<<2)
#define BDMA_CCR4_TCIE_B_0X0    (0x0U<<1)
#define BDMA_CCR4_TCIE_B_0X1    (0x1U<<1)
#define BDMA_CCR4_EN_B_0X0      (0x0U<<0)
#define BDMA_CCR4_EN_B_0X1      (0x1U<<0)

// CNDTR4 Configuration

#define BDMA_CNDTR4_NDT         (0xFFFFU<<0)
#define BDMA_CNDTR4_NDT_0       (0x1U<<0)

// CPAR4 Configuration

#define BDMA_CPAR4_PA           (0xFFFFFFFFU<<0)
#define BDMA_CPAR4_PA_0         (0x1U<<0)

// CM0AR4 Configuration

#define BDMA_CM0AR4_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM0AR4_MA_0        (0x1U<<0)

// CM1AR4 Configuration

#define BDMA_CM1AR4_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM1AR4_MA_0        (0x1U<<0)

// CCR5 Configuration

#define BDMA_CCR5_CT            (0x1U<<16)
#define BDMA_CCR5_DBM           (0x1U<<15)
#define BDMA_CCR5_MEM2MEM       (0x1U<<14)
#define BDMA_CCR5_PL            (0x3U<<12)
#define BDMA_CCR5_PL_0          (0x1U<<12)
#define BDMA_CCR5_MSIZE         (0x3U<<10)
#define BDMA_CCR5_MSIZE_0       (0x1U<<10)
#define BDMA_CCR5_PSIZE         (0x3U<<8)
#define BDMA_CCR5_PSIZE_0       (0x1U<<8)
#define BDMA_CCR5_MINC          (0x1U<<7)
#define BDMA_CCR5_PINC          (0x1U<<6)
#define BDMA_CCR5_CIRC          (0x1U<<5)
#define BDMA_CCR5_DIR           (0x1U<<4)
#define BDMA_CCR5_TEIE          (0x1U<<3)
#define BDMA_CCR5_HTIE          (0x1U<<2)
#define BDMA_CCR5_TCIE          (0x1U<<1)
#define BDMA_CCR5_EN            (0x1U<<0)
#define BDMA_CCR5_CT_B_0X0      (0x0U<<16)
#define BDMA_CCR5_CT_B_0X1      (0x1U<<16)
#define BDMA_CCR5_DBM_B_0X0     (0x0U<<15)
#define BDMA_CCR5_DBM_B_0X1     (0x1U<<15)
#define BDMA_CCR5_MEM2MEM_B_0X0 (0x0U<<14)
#define BDMA_CCR5_MEM2MEM_B_0X1 (0x1U<<14)
#define BDMA_CCR5_PL_B_0X0      (0x0U<<12)
#define BDMA_CCR5_PL_B_0X1      (0x1U<<12)
#define BDMA_CCR5_PL_B_0X2      (0x2U<<12)
#define BDMA_CCR5_PL_B_0X3      (0x3U<<12)
#define BDMA_CCR5_MSIZE_B_0X0   (0x0U<<10)
#define BDMA_CCR5_MSIZE_B_0X1   (0x1U<<10)
#define BDMA_CCR5_MSIZE_B_0X2   (0x2U<<10)
#define BDMA_CCR5_PSIZE_B_0X0   (0x0U<<8)
#define BDMA_CCR5_PSIZE_B_0X1   (0x1U<<8)
#define BDMA_CCR5_PSIZE_B_0X2   (0x2U<<8)
#define BDMA_CCR5_MINC_B_0X0    (0x0U<<7)
#define BDMA_CCR5_MINC_B_0X1    (0x1U<<7)
#define BDMA_CCR5_PINC_B_0X0    (0x0U<<6)
#define BDMA_CCR5_PINC_B_0X1    (0x1U<<6)
#define BDMA_CCR5_CIRC_B_0X0    (0x0U<<5)
#define BDMA_CCR5_CIRC_B_0X1    (0x1U<<5)
#define BDMA_CCR5_DIR_B_0X0     (0x0U<<4)
#define BDMA_CCR5_DIR_B_0X1     (0x1U<<4)
#define BDMA_CCR5_TEIE_B_0X0    (0x0U<<3)
#define BDMA_CCR5_TEIE_B_0X1    (0x1U<<3)
#define BDMA_CCR5_HTIE_B_0X0    (0x0U<<2)
#define BDMA_CCR5_HTIE_B_0X1    (0x1U<<2)
#define BDMA_CCR5_TCIE_B_0X0    (0x0U<<1)
#define BDMA_CCR5_TCIE_B_0X1    (0x1U<<1)
#define BDMA_CCR5_EN_B_0X0      (0x0U<<0)
#define BDMA_CCR5_EN_B_0X1      (0x1U<<0)

// CNDTR5 Configuration

#define BDMA_CNDTR5_NDT         (0xFFFFU<<0)
#define BDMA_CNDTR5_NDT_0       (0x1U<<0)

// CPAR5 Configuration

#define BDMA_CPAR5_PA           (0xFFFFFFFFU<<0)
#define BDMA_CPAR5_PA_0         (0x1U<<0)

// CM0AR5 Configuration

#define BDMA_CM0AR5_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM0AR5_MA_0        (0x1U<<0)

// CM1AR5 Configuration

#define BDMA_CM1AR5_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM1AR5_MA_0        (0x1U<<0)

// CCR6 Configuration

#define BDMA_CCR6_CT            (0x1U<<16)
#define BDMA_CCR6_DBM           (0x1U<<15)
#define BDMA_CCR6_MEM2MEM       (0x1U<<14)
#define BDMA_CCR6_PL            (0x3U<<12)
#define BDMA_CCR6_PL_0          (0x1U<<12)
#define BDMA_CCR6_MSIZE         (0x3U<<10)
#define BDMA_CCR6_MSIZE_0       (0x1U<<10)
#define BDMA_CCR6_PSIZE         (0x3U<<8)
#define BDMA_CCR6_PSIZE_0       (0x1U<<8)
#define BDMA_CCR6_MINC          (0x1U<<7)
#define BDMA_CCR6_PINC          (0x1U<<6)
#define BDMA_CCR6_CIRC          (0x1U<<5)
#define BDMA_CCR6_DIR           (0x1U<<4)
#define BDMA_CCR6_TEIE          (0x1U<<3)
#define BDMA_CCR6_HTIE          (0x1U<<2)
#define BDMA_CCR6_TCIE          (0x1U<<1)
#define BDMA_CCR6_EN            (0x1U<<0)
#define BDMA_CCR6_CT_B_0X0      (0x0U<<16)
#define BDMA_CCR6_CT_B_0X1      (0x1U<<16)
#define BDMA_CCR6_DBM_B_0X0     (0x0U<<15)
#define BDMA_CCR6_DBM_B_0X1     (0x1U<<15)
#define BDMA_CCR6_MEM2MEM_B_0X0 (0x0U<<14)
#define BDMA_CCR6_MEM2MEM_B_0X1 (0x1U<<14)
#define BDMA_CCR6_PL_B_0X0      (0x0U<<12)
#define BDMA_CCR6_PL_B_0X1      (0x1U<<12)
#define BDMA_CCR6_PL_B_0X2      (0x2U<<12)
#define BDMA_CCR6_PL_B_0X3      (0x3U<<12)
#define BDMA_CCR6_MSIZE_B_0X0   (0x0U<<10)
#define BDMA_CCR6_MSIZE_B_0X1   (0x1U<<10)
#define BDMA_CCR6_MSIZE_B_0X2   (0x2U<<10)
#define BDMA_CCR6_PSIZE_B_0X0   (0x0U<<8)
#define BDMA_CCR6_PSIZE_B_0X1   (0x1U<<8)
#define BDMA_CCR6_PSIZE_B_0X2   (0x2U<<8)
#define BDMA_CCR6_MINC_B_0X0    (0x0U<<7)
#define BDMA_CCR6_MINC_B_0X1    (0x1U<<7)
#define BDMA_CCR6_PINC_B_0X0    (0x0U<<6)
#define BDMA_CCR6_PINC_B_0X1    (0x1U<<6)
#define BDMA_CCR6_CIRC_B_0X0    (0x0U<<5)
#define BDMA_CCR6_CIRC_B_0X1    (0x1U<<5)
#define BDMA_CCR6_DIR_B_0X0     (0x0U<<4)
#define BDMA_CCR6_DIR_B_0X1     (0x1U<<4)
#define BDMA_CCR6_TEIE_B_0X0    (0x0U<<3)
#define BDMA_CCR6_TEIE_B_0X1    (0x1U<<3)
#define BDMA_CCR6_HTIE_B_0X0    (0x0U<<2)
#define BDMA_CCR6_HTIE_B_0X1    (0x1U<<2)
#define BDMA_CCR6_TCIE_B_0X0    (0x0U<<1)
#define BDMA_CCR6_TCIE_B_0X1    (0x1U<<1)
#define BDMA_CCR6_EN_B_0X0      (0x0U<<0)
#define BDMA_CCR6_EN_B_0X1      (0x1U<<0)

// CNDTR6 Configuration

#define BDMA_CNDTR6_NDT         (0xFFFFU<<0)
#define BDMA_CNDTR6_NDT_0       (0x1U<<0)

