Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_bdma.h
// CPAR6 Configuration

#define BDMA_CPAR6_PA           (0xFFFFFFFFU<<0)
#define BDMA_CPAR6_PA_0         (0x1U<<0)

// CM0AR6 Configuration

#define BDMA_CM0AR6_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM0AR6_MA_0        (0x1U<<0)

// CM1AR6 Configuration

#define BDMA_CM1AR6_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM1AR6_MA_0        (0x1U<<0)

// CCR7 Configuration

#define BDMA_CCR7_CT            (0x1U<<16)
#define BDMA_CCR7_DBM           (0x1U<<15)
#define BDMA_CCR7_MEM2MEM       (0x1U<<14)
#define BDMA_CCR7_PL            (0x3U<<12)
#define BDMA_CCR7_PL_0          (0x1U<<12)
#define BDMA_CCR7_MSIZE         (0x3U<<10)
#define BDMA_CCR7_MSIZE_0       (0x1U<<10)
#define BDMA_CCR7_PSIZE         (0x3U<<8)
#define BDMA_CCR7_PSIZE_0       (0x1U<<8)
#define BDMA_CCR7_MINC          (0x1U<<7)
#define BDMA_CCR7_PINC          (0x1U<<6)
#define BDMA_CCR7_CIRC          (0x1U<<5)
#define BDMA_CCR7_DIR           (0x1U<<4)
#define BDMA_CCR7_TEIE          (0x1U<<3)
#define BDMA_CCR7_HTIE          (0x1U<<2)
#define BDMA_CCR7_TCIE          (0x1U<<1)
#define BDMA_CCR7_EN            (0x1U<<0)
#define BDMA_CCR7_CT_B_0X0      (0x0U<<16)
#define BDMA_CCR7_CT_B_0X1      (0x1U<<16)
#define BDMA_CCR7_DBM_B_0X0     (0x0U<<15)
#define BDMA_CCR7_DBM_B_0X1     (0x1U<<15)
#define BDMA_CCR7_MEM2MEM_B_0X0 (0x0U<<14)
#define BDMA_CCR7_MEM2MEM_B_0X1 (0x1U<<14)
#define BDMA_CCR7_PL_B_0X0      (0x0U<<12)
#define BDMA_CCR7_PL_B_0X1      (0x1U<<12)
#define BDMA_CCR7_PL_B_0X2      (0x2U<<12)
#define BDMA_CCR7_PL_B_0X3      (0x3U<<12)
#define BDMA_CCR7_MSIZE_B_0X0   (0x0U<<10)
#define BDMA_CCR7_MSIZE_B_0X1   (0x1U<<10)
#define BDMA_CCR7_MSIZE_B_0X2   (0x2U<<10)
#define BDMA_CCR7_PSIZE_B_0X0   (0x0U<<8)
#define BDMA_CCR7_PSIZE_B_0X1   (0x1U<<8)
#define BDMA_CCR7_PSIZE_B_0X2   (0x2U<<8)
#define BDMA_CCR7_MINC_B_0X0    (0x0U<<7)
#define BDMA_CCR7_MINC_B_0X1    (0x1U<<7)
#define BDMA_CCR7_PINC_B_0X0    (0x0U<<6)
#define BDMA_CCR7_PINC_B_0X1    (0x1U<<6)
#define BDMA_CCR7_CIRC_B_0X0    (0x0U<<5)
#define BDMA_CCR7_CIRC_B_0X1    (0x1U<<5)
#define BDMA_CCR7_DIR_B_0X0     (0x0U<<4)
#define BDMA_CCR7_DIR_B_0X1     (0x1U<<4)
#define BDMA_CCR7_TEIE_B_0X0    (0x0U<<3)
#define BDMA_CCR7_TEIE_B_0X1    (0x1U<<3)
#define BDMA_CCR7_HTIE_B_0X0    (0x0U<<2)
#define BDMA_CCR7_HTIE_B_0X1    (0x1U<<2)
#define BDMA_CCR7_TCIE_B_0X0    (0x0U<<1)
#define BDMA_CCR7_TCIE_B_0X1    (0x1U<<1)
#define BDMA_CCR7_EN_B_0X0      (0x0U<<0)
#define BDMA_CCR7_EN_B_0X1      (0x1U<<0)

// CNDTR7 Configuration

#define BDMA_CNDTR7_NDT         (0xFFFFU<<0)
#define BDMA_CNDTR7_NDT_0       (0x1U<<0)

// CPAR7 Configuration

#define BDMA_CPAR7_PA           (0xFFFFFFFFU<<0)
#define BDMA_CPAR7_PA_0         (0x1U<<0)

// CM0AR7 Configuration

#define BDMA_CM0AR7_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM0AR7_MA_0        (0x1U<<0)

// CM1AR7 Configuration

#define BDMA_CM1AR7_MA          (0xFFFFFFFFU<<0)
#define BDMA_CM1AR7_MA_0        (0x1U<<0)
